<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

# Practice SQL with `pandas`, Pt. 2

_Authors: Sam Stack (DC)_

---

We've learned about relational databases and the language most use to query them: SQL.  

In this lab, we are going to get more practice converting information to a SQL database, querying that data, and then analyzing it with Python.

In [1]:
# Necessary libraries:
import pandas as pd
import sqlite3
from pandas.io import sql

#### 1.  Read in the `EuroMart` `.csv` data.
- 'EuroMart-ListOfOrders.csv'
- 'EuroMart-OrderBreakdown.csv'
- 'EuroMart-SalesTargets.csv'

In [37]:
# Reading in the `.csv` to a DataFrame:
orders = pd.read_csv('../datasets/csv/EuroMart-ListOfOrders.csv', encoding = 'utf-8')
OBD =  pd.read_csv('../datasets/csv/EuroMart-OrderBreakdown.csv', encoding = 'utf-8')
sales_targets =  pd.read_csv('../datasets/csv/EuroMart-SalesTargets.csv', encoding = 'utf-8')

#### 2. Rename columns to remove any spaces.

In [38]:
# Renaming columns to remove spaces:
orders.columns = ['order_id','order_date','customer_name','city','country','region',
                        'segment','ship_date','ship_mode','state']
OBD.columns = ['order_id','product_name','discount','sales','profit','quantity',
          'category','sub-category']
 
sales_targets.columns = ['month_of_order_date','category','target']

#### 3. Remove dollar signs from the `sales` and `profit` columns in the `order breakdown` DataFrame.

Convert the columns to float.

In [39]:
# Removing dollar signs from the `sales` and `profit` columns:
OBD['sales'] = OBD['sales'].map(lambda x: x.strip('$'))
OBD['sales'] = OBD['sales'].map(lambda x: float(x.replace(',','')))

OBD['profit'] = OBD['profit'].map(lambda x: x.replace('$',''))
OBD['profit'] = OBD['profit'].map(lambda x: float(x.replace(',','')))

#### 4. Create a SQL database called `EuroMart` and save the three DataFrames as SQL tables.

In [40]:
# Establishing a local DB connection:
db_connection = sqlite3.connect('../datasets/sql/EuroMart.db.sqlite')

# # Reading out DataFrames as SQL tables:
orders.to_sql(name = 'orders', con = db_connection, if_exists = 'replace', index = False)
OBD.to_sql(name = 'order_breakdown', con = db_connection, if_exists = 'replace', index = False)
sales_targets.to_sql(name = 'sales_targets', con = db_connection, if_exists = 'replace', index = False)

In [6]:
# Getting the column Labels:  
orders.head(1)

,order_id,order_date,customer_name,city,country,region,segment,ship_date,ship_mode,state
0,BN-2011-7407039,1/1/2011,Ruby Patel,Stockholm,Sweden,North,Home Office,1/5/2011,Economy Plus,Stockholm

In [7]:
OBD.head(1)

,order_id,product_name,discount,sales,profit,quantity,category,sub-category
0,BN-2011-7407039,"Enermax Note Cards, Premium",0.5,45.0,-26.0,3,Office Supplies,Paper

In [8]:
sales_targets.head(1)

  month_of_order_date   category      target
0              Jan-11  Furniture  $10,000.00

#### 5. How many orders has each customer placed?

In [9]:
# Getting all customer names and setting them to a `pandas` object:
customers = sql.read_sql('SELECT customer_name FROM orders', con = db_connection)

# Counting unique values in the list:
customers['customer_name'].value_counts().head()

Jose Gambino       13
Mark Washington    12
Kayla Tearle       12
Terence Welch      11
Maya Pamphlett     11
Name: customer_name, dtype: int64

> *If you're doubting your output, check using `pandas`.*

#### 6. Create a query to return a table containing only geographic features from the `list of orders` table.

In [10]:
# City, country, region, and state are all geographic.
sql.read_sql('SELECT city, country, region, state FROM orders', con = db_connection).head()

         city         country   region                 state
0   Stockholm          Sweden    North             Stockholm
1   Southport  United Kingdom    North               England
2     Valence          France  Central  Auvergne-Rhône-Alpes
3  Birmingham  United Kingdom    North               England
4  Echirolles          France  Central  Auvergne-Rhône-Alpes

#### 7. Create a query to return a table containing all orders that had a negative profit from the `order breakdown` table.

In [11]:
# Identifying any cell in the `profit` column with a '-' sign:
sql.read_sql('SELECT * from order_breakdown WHERE profit LIKE "%-%"', con = db_connection).head()
# We had not converted values ints prior to writing this.  
# It works with ints and objects!

,order_id,product_name,discount,sales,profit,quantity,category,sub-category
0,BN-2011-7407039,"Enermax Note Cards, Premium",0.5,45.0,-26.0,3,Office Supplies,Paper
1,BN-2011-2819714,"Boston Markers, Easy-Erase",0.5,27.0,-22.0,2,Office Supplies,Art
2,BN-2011-2819714,"Eldon Folders, Single Width",0.5,17.0,-1.0,2,Office Supplies,Storage
3,BN-2011-3248724,"Ikea Classic Bookcase, Metal",0.6,987.0,-1012.0,6,Furniture,Bookcases
4,BN-2011-3248724,"Binney & Smith Sketch Pad, Blue",0.5,116.0,-56.0,5,Office Supplies,Art

#### 8. Construct a query to return a table containing `customer_name` and `product_name`.  

> **Note:** This will require a JOIN!

In [12]:
sql.read_sql('SELECT orders."order_id", orders."customer_name", order_breakdown."product_name"'
'FROM orders '
'LEFT JOIN order_breakdown '
'ON orders."order_id"= order_breakdown."order_id"',
            con = db_connection).head()

          order_id     customer_name                           product_name
0  BN-2011-7407039        Ruby Patel            Enermax Note Cards, Premium
1  AZ-2011-9050313    Summer Hayward     Dania Corner Shelving, Traditional
2  AZ-2011-6674300  Devin Huddleston  Binney & Smith Sketch Pad, Easy-Erase
3  BN-2011-2819714       Mary Parker             Boston Markers, Easy-Erase
4  BN-2011-2819714       Mary Parker            Eldon Folders, Single Width

#### 9.  How many orders for "office supplies" (category) has Sweden made?

> **Note:** From this point on, you'll probably be combining SQL and `pandas`, in that you would use SQL queries to gather relevant information and then `pandas` to analyze it.

In [13]:
sweedish_supplies = sql.read_sql('SELECT orders."order_id", orders."country", order_breakdown."category" '            
'FROM orders '
'LEFT JOIN order_breakdown '
'ON orders."order_id"= order_breakdown."order_id"'
'WHERE orders."country" = "Sweden" and order_breakdown."category"="Office Supplies"',
            con = db_connection)

sweedish_supplies.count()

order_id    133
country     133
category    133
dtype: int64

#### 10. What were total sales for discontinued products?

In [14]:
discount_sales = sql.read_sql('SELECT discount, sales FROM order_breakdown WHERE discount > 0',
                              con = db_connection)

discount_sales['sales'].sum()

1115614.0

#### 11. What is the total quantity of objects sold for each country?

In [15]:
order_counts = sql.read_sql('SELECT order_breakdown."quantity", orders."country" '
                            'FROM orders '
                            'INNER JOIN order_breakdown '
                            'ON orders."order_id"= order_breakdown."order_id" ',
            con = db_connection)

order_counts.groupby('country').sum()

                quantity
country
Austria              973
Belgium              532
Denmark              204
Finland              201
France              7329
Germany             6179
Ireland              392
Italy               3612
Netherlands         1526
Norway               261
Portugal             286
Spain               2881
Sweden               753
Switzerland          308
United Kingdom      4917

#### 12. In what countries were profits lowest? (Report the lowest 5-10).

In [36]:
# Gather `country` and `profit`. 
profits = sql.read_sql('SELECT order_breakdown."profit", orders."country" '
                            'FROM orders '
                            'INNER JOIN order_breakdown '
                            'ON orders."order_id"= order_breakdown."order_id" ',
            con = db_connection)

# GROUP BY country and sum with sort on `profit`.
profits.groupby('country').sum().sort_values('profit').reset_index()[5:11]

        country   profit
5       Finland   3908.0
6        Norway   5167.0
7   Switzerland   7234.0
8       Belgium   9912.0
9         Italy  15802.0
10      Austria  21332.0

#### 13. What counties have the best and worst sales-to-profit ratios?
(Total sales divided by total profits).

Essentially, this is asking us to determine the profit made for every dollar of product sold.

In [19]:
# Total profits/Total sales
# Grabbing profits, sales, and countries:
spr = sql.read_sql('SELECT order_breakdown."profit",order_breakdown."sales", orders."country" '
                            'FROM orders '
                            'INNER JOIN order_breakdown '
                            'ON orders."order_id"= order_breakdown."order_id" ',
            con = db_connection)

# Summing profits and sales by country:
spr2 = spr.groupby('country').sum().sort_values('profit')

# Creating the ratio column:
spr2['ratio'] = spr2['profit']/spr2['sales']

# Sorting by ratio column:
spr2.sort_values('ratio', ascending = False)

                 profit     sales     ratio
country
Switzerland      7234.0   24874.0  0.290826
Austria         21332.0   79382.0  0.268726
Norway           5167.0   20529.0  0.251693
Belgium          9912.0   42320.0  0.234216
United Kingdom  90382.0  420497.0  0.214941
Finland          3908.0   20702.0  0.188774
Spain           47067.0  249402.0  0.188719
Germany         86279.0  488681.0  0.176555
France          70067.0  609683.0  0.114924
Italy           15802.0  252742.0  0.062522
Ireland         -6886.0   15998.0 -0.430429
Denmark         -3608.0    7763.0 -0.464769
Netherlands    -37188.0   70313.0 -0.528892
Sweden         -17524.0   30490.0 -0.574746
Portugal        -8704.0   15106.0 -0.576195

#### 14. What shipping method is most commonly used for "bookcases" (sub-category)?

In [20]:
sql.read_sql('SELECT orders."ship_mode",order_breakdown."sub-category"'
                            'FROM orders '
                            'INNER JOIN order_breakdown '
                            'ON orders."order_id"= order_breakdown."order_id" '
                            'WHERE "sub-category" = "Bookcases"' ,
            con = db_connection)['ship_mode'].value_counts()

Economy         234
Economy Plus     76
Priority         59
Immediate        22
Name: ship_mode, dtype: int64

#### 15. Which city in the `orders` table generated the highest net sales? (List all cities and countries in descending order by net sales).

In [22]:
sql.read_sql('SELECT orders."city",orders."country", order_breakdown."sales"'
                            'FROM orders '
                            'INNER JOIN order_breakdown '
                            'ON orders."order_id"= order_breakdown."order_id" ',
            con = db_connection).groupby(['city','country']).sum().sort_values('sales', ascending = False)

                                          sales
city                    country
London                  United Kingdom  69230.0
Berlin                  Germany         52555.0
Vienna                  Austria         51844.0
Madrid                  Spain           44981.0
Paris                   France          42245.0
Rome                    Italy           28330.0
Barcelona               Spain           27405.0
Hamburg                 Germany         23574.0
Marseille               France          21677.0
Turin                   Italy           19829.0
Milan                   Italy           18837.0
Munich                  Germany         18429.0
Edinburgh               United Kingdom  18016.0
Stockholm               Sweden          17498.0
Bremen                  Germany         15342.0
Bochum                  Germany         15144.0
Valencia                Spain           14958.0
Frankfurt               Germany         14640.0
Lille                   France          14102.0
Cologne                 Germany         13301.0
Nice                    France          13229.0
Dortmund                Germany         12724.0
Leipzig                 Germany         12380.0
Leeds                   United Kingdom  11884.0
Toulouse                France          11565.0
Krefeld                 Germany         11410.0
Naples                  Italy           11388.0
Essen                   Germany         11211.0
Dublin                  Ireland         11071.0
Valladolid              Spain           10938.0
...                                         ...
Montigny-le-Bretonneux  France             36.0
Lagny-sur-Marne         France             35.0
Randers                 Denmark            34.0
Estepona                Spain              34.0
Torremolinos            Spain              33.0
Saint-Jean-de-la-Ruelle France             31.0
La Crau                 France             31.0
Castellammare di Stabia Italy              30.0
Odivelas                Portugal           29.0
Cluses                  France             28.0
Vigevano                Italy              28.0
Oss                     Netherlands        27.0
Morley                  United Kingdom     27.0
Givors                  France             26.0
Massa                   Italy              26.0
Falconara Marittima     Italy              26.0
Viroflay                France             26.0
Andria                  Italy              26.0
Manfredonia             Italy              25.0
Illkirch-Graffenstaden  France             24.0
Cestas                  France             23.0
Ragusa                  Italy              22.0
Battipaglia             Italy              22.0
Millau                  France             21.0
Leiden                  Netherlands        19.0
Friedberg               Germany            18.0
Sorgues                 France             14.0
Sète                    France             14.0
Aix-les-Bains           France             10.0
Osny                    France              5.0

[999 rows x 1 columns]

####  BONUS: Create a column called `shipping_delay` in the `orders` table that contains the difference in days between `order_date` and `ship_date`.

In [23]:
# Converting columns to datetime objects from objects:
orders['order_date'] = pd.to_datetime(orders['order_date'])
orders['ship_date'] = pd.to_datetime(orders['ship_date'])

In [24]:
# Engineering a feature that counts the difference in days:
orders['ship_delay'] = (orders['ship_date']-orders['order_date']).astype('timedelta64[h]')/24

# Or, just use `timedelta64[D]` to get days.

#### BONUS: Update your `orders` table in your SQLite3 DB to include the `shipping_delay` feature.

In [25]:
# Updating and replacing the `order` data table:
orders.to_sql(name = 'orders', con = db_connection, if_exists = 'replace', index = False)

#### BONUS: Which product category has the highest average `shipping_delay`?

In [26]:
sql.read_sql('SELECT orders."ship_delay", order_breakdown."category"'
                            'FROM orders '
                            'INNER JOIN order_breakdown '
                            'ON orders."order_id"= order_breakdown."order_id" ',
            con = db_connection).groupby('category').mean()

                 ship_delay
category
Furniture          4.000000
Office Supplies    3.975028
Technology         4.125410

### Challenge

**In which months and categories were sales targets exceeded?**

---

This may require a considerable amount of data processing.

In [27]:
# First I'm going to extract the information I need using SQL:
month_sales = sql.read_sql('SELECT orders."order_date", order_breakdown."sales",order_breakdown."category" '
             'FROM orders '
             'INNER JOIN order_breakdown '
             'ON orders."order_id" = order_breakdown."order_id" ', 
             con = db_connection)

# Convert `order_date` to a datetime object.
month_sales["order_date"] = pd.to_datetime(month_sales["order_date"])

# Create a column that aggregates dates in 'mon-yy' format.
month_sales['mnth_yr'] = month_sales['order_date'].apply(lambda x: x.strftime('%b-%y'))

In [28]:
# Taking the new date objects and using them to GROUP BY to determine the sum of sales:
month_sales = month_sales.groupby(['mnth_yr','category']).sales.sum().reset_index()

In [29]:
# Pushing this new DataFrame, which was created with monthly aggregates, back to a local SQL DB:
month_sales.to_sql(name = 'sales_by_month', con = db_connection, if_exists = 'replace', index = False)

In [30]:
# Extracting information again, joining the newly created table and the `sales_targets` table:
targets = sql.read_sql('SELECT sales_targets."month_of_order_date", sales_targets."category", sales_targets."target",sales_by_month."sales"'
                      'FROM sales_targets '
                      'INNER JOIN sales_by_month '
                      'ON sales_targets."month_of_order_date" = sales_by_month."mnth_yr" AND '
                      'sales_targets."category" = sales_by_month."category"',
                      con = db_connection)
# This is a double JOIN in that it matches values in two columns.

In [31]:
# Removing string values and converting `targets` to a float dtype:
targets['target'] = targets['target'].map(lambda x: x.replace('$',''))
targets['target'] = (targets['target'].map(lambda x: x.replace(',',''))).astype(float)

In [32]:
# Creating a Boolean list that states whether or not sales exceeded their targets:
exceeded = []
for ind in range(len(targets['target'])):
    if targets['target'][ind] > targets['sales'][ind]:
        exceeded.append(False)
    elif targets['target'][ind] < targets['sales'][ind]:
        exceeded.append(True)

In [33]:
# Appending the list to the DataFrame as a column:
targets['exceeded'] = exceeded

In [34]:
# Getting those values that exceed targets:
targets[targets['exceeded'] == True]

    month_of_order_date         category   target    sales exceeded
1                Feb-11        Furniture  10100.0  13541.0     True
5                Jun-11        Furniture  10600.0  14737.0     True
8                Sep-11        Furniture  11000.0  13763.0     True
10               Nov-11        Furniture  11300.0  15194.0     True
11               Dec-11        Furniture  11400.0  23611.0     True
17               Jun-12        Furniture  12100.0  21661.0     True
19               Aug-12        Furniture  12400.0  21300.0     True
20               Sep-12        Furniture  12500.0  20161.0     True
21               Oct-12        Furniture  12600.0  14923.0     True
22               Nov-12        Furniture  12800.0  15100.0     True
23               Dec-12        Furniture  12900.0  13979.0     True
29               Jun-13        Furniture  13600.0  21226.0     True
31               Aug-13        Furniture  13900.0  19006.0     True
32               Sep-13        Furniture  14000.0  20610.0     True
34               Nov-13        Furniture  14300.0  25195.0     True
35               Dec-13        Furniture  14400.0  17084.0     True
39               Apr-14        Furniture  14900.0  15165.0     True
41               Jun-14        Furniture  15100.0  27489.0     True
43               Aug-14        Furniture  15400.0  24606.0     True
44               Sep-14        Furniture  15500.0  35226.0     True
46               Nov-14        Furniture  15800.0  28633.0     True
47               Dec-14        Furniture  15900.0  18843.0     True
48               Jan-11  Office Supplies   5000.0   5730.0     True
50               Mar-11  Office Supplies   5000.0   9820.0     True
51               Apr-11  Office Supplies  10000.0  10069.0     True
52               May-11  Office Supplies  10000.0  12062.0     True
53               Jun-11  Office Supplies  10000.0  17124.0     True
55               Aug-11  Office Supplies  12000.0  14215.0     True
56               Sep-11  Office Supplies  12000.0  28848.0     True
58               Nov-11  Office Supplies  14000.0  16852.0     True
..                  ...              ...      ...      ...      ...
89               Jun-14  Office Supplies  16000.0  22941.0     True
91               Aug-14  Office Supplies  18000.0  36979.0     True
92               Sep-14  Office Supplies  18000.0  30166.0     True
94               Nov-14  Office Supplies  26000.0  33305.0     True
95               Dec-14  Office Supplies  26000.0  30133.0     True
101              Jun-11       Technology   9000.0  16976.0     True
102              Jul-11       Technology   9000.0   9705.0     True
103              Aug-11       Technology   9000.0  23001.0     True
104              Sep-11       Technology   9000.0  19844.0     True
106              Nov-11       Technology   9000.0  20521.0     True
107              Dec-11       Technology   9000.0  20677.0     True
110              Mar-12       Technology  16000.0  17161.0     True
113              Jun-12       Technology  16000.0  19522.0     True
115              Aug-12       Technology  16000.0  34577.0     True
116              Sep-12       Technology  16000.0  24539.0     True
118              Nov-12       Technology  16000.0  18401.0     True
119              Dec-12       Technology  16000.0  25323.0     True
124              May-13       Technology  20000.0  20673.0     True
125              Jun-13       Technology  20000.0  40355.0     True
126              Jul-13       Technology  20000.0  20298.0     True
127              Aug-13       Technology  20000.0  20949.0     True
128              Sep-13       Technology  20000.0  24332.0     True
130              Nov-13       Technology  20000.0  21889.0     True
131              Dec-13       Technology  20000.0  20502.0     True
132              Jan-14       Technology  23000.0  24140.0     True
137              Jun-14       Technology  23000.0  30895.0     True
139              Aug-14       Technology  23000.0  45484.0     True
140              Sep-14       Technology  23000.0  35933.0     True
142              Nov-14       Technology  23000.0  29909.0     True
143              Dec-14       Technology  23000.0  34112.0     True

[84 rows x 5 columns]

**In what months and categories did sales fail to exceed their targets?**

In [35]:
# Getting those values that did not exceed expectations:

targets[targets['exceeded'] == False]

    month_of_order_date         category   target    sales exceeded
0                Jan-11        Furniture  10000.0   5477.0    False
2                Mar-11        Furniture  10300.0   7210.0    False
3                Apr-11        Furniture  10400.0   4115.0    False
4                May-11        Furniture  10500.0   8653.0    False
6                Jul-11        Furniture  10800.0   2282.0    False
7                Aug-11        Furniture  10900.0  10606.0    False
9                Oct-11        Furniture  11100.0   4084.0    False
12               Jan-12        Furniture  11500.0   5525.0    False
13               Feb-12        Furniture  11600.0   5820.0    False
14               Mar-12        Furniture  11800.0   9496.0    False
15               Apr-12        Furniture  11900.0   5447.0    False
16               May-12        Furniture  12000.0   8019.0    False
18               Jul-12        Furniture  12300.0   7525.0    False
24               Jan-13        Furniture  13000.0  10085.0    False
25               Feb-13        Furniture  13100.0  11749.0    False
26               Mar-13        Furniture  13300.0  10018.0    False
27               Apr-13        Furniture  13400.0   5729.0    False
28               May-13        Furniture  13500.0   8767.0    False
30               Jul-13        Furniture  13800.0  11147.0    False
33               Oct-13        Furniture  14100.0   5141.0    False
36               Jan-14        Furniture  14500.0   9325.0    False
37               Feb-14        Furniture  14600.0   8586.0    False
38               Mar-14        Furniture  14800.0   6813.0    False
40               May-14        Furniture  15000.0   7298.0    False
42               Jul-14        Furniture  15300.0  13418.0    False
45               Oct-14        Furniture  15600.0   5421.0    False
49               Feb-11  Office Supplies   5000.0   3460.0    False
54               Jul-11  Office Supplies  12000.0   4648.0    False
57               Oct-11  Office Supplies  14000.0   6555.0    False
61               Feb-12  Office Supplies  10000.0   4157.0    False
63               Apr-12  Office Supplies  12000.0  10109.0    False
69               Oct-12  Office Supplies  16000.0   9602.0    False
74               Mar-13  Office Supplies  16000.0  12959.0    False
78               Jul-13  Office Supplies  18000.0  17275.0    False
81               Oct-13  Office Supplies  20000.0   5939.0    False
90               Jul-14  Office Supplies  18000.0  11918.0    False
93               Oct-14  Office Supplies  26000.0  14330.0    False
96               Jan-11       Technology   9000.0   3128.0    False
97               Feb-11       Technology   9000.0   4645.0    False
98               Mar-11       Technology   9000.0   3537.0    False
99               Apr-11       Technology   9000.0   7736.0    False
100              May-11       Technology   9000.0   8240.0    False
105              Oct-11       Technology   9000.0   5031.0    False
108              Jan-12       Technology  16000.0   9636.0    False
109              Feb-12       Technology  16000.0   5327.0    False
111              Apr-12       Technology  16000.0  15215.0    False
112              May-12       Technology  16000.0  14022.0    False
114              Jul-12       Technology  16000.0  15150.0    False
117              Oct-12       Technology  16000.0  11161.0    False
120              Jan-13       Technology  20000.0  11649.0    False
121              Feb-13       Technology  20000.0  16395.0    False
122              Mar-13       Technology  20000.0   5899.0    False
123              Apr-13       Technology  20000.0  14152.0    False
129              Oct-13       Technology  20000.0  18858.0    False
133              Feb-14       Technology  23000.0  15891.0    False
134              Mar-14       Technology  23000.0  13201.0    False
135              Apr-14       Technology  23000.0  17185.0    False
136              May-14       Technology  23000.0  12300.0    False
138              Jul-14       Technology  23000.0  17123.0    False
141              Oct-14       Technology  23000.0  20816.0    False